Tekla Open API Reference for Tekla Structures 2025
ReportTemplateElement Constructor
 Creates a new report template element instance with the default template.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReportTemplateElement()
Public Sub New
See Also
Reference
ReportTemplateElement Class
ReportTemplateElement Overload
Tekla.Structures.Drawing Namespace